Revit 2024 API
ThemeChangedEventArgs Class
 The event arguments used by the ThemeChanged event.
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public class ThemeChangedEventArgs : RevitAPISingleEventArgs
Visual Basic
Public Class ThemeChangedEventArgs _
	Inherits RevitAPISingleEventArgs
Visual C++
public ref class ThemeChangedEventArgs : public RevitAPISingleEventArgs
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPISingleEventArgs
 Autodesk.Revit.UI.Events.ThemeChangedEventArgs
See Also
ThemeChangedEventArgs Members
Autodesk.Revit.UI.Events Namespace